<?php

require_once '../../../models/ChartJS_Bar.php';
require_once '../../../models/ChartJS_Pie.php';
require_once '../../../models/ChartJS_Line.php';
use Models\ChartJS_Bar;
use Models\ChartJS_Pie;
use Models\ChartJS_Line;

class CoursePreview {

    public function course_student_avg_attempts_to_pass ($user, $plot): string
    {
        $tempText = '';
        if ($plot === 'table') {
            if ($user === 'user') {
                $tempText .= '<div id="div_class">'.PHP_EOL.
                    "\t".'<h3 class="main_title">میانگین تعداد تلاش ها برای قبولی در آزمون ها در دوره های sample_teacher</h3>'.PHP_EOL.
                    "\t".'<table class="data-table">'.PHP_EOL."\t\t".'<tr>'.PHP_EOL.
                    "\t\t".'<th>نام دوره</th>'.PHP_EOL."\t\t".'<th>نام آزمون</th>'.PHP_EOL."\t\t".'<th>تعداد شرکت کنندگان در آزمون</th>'.PHP_EOL."\t\t".'<th>مجموع تلاش ها برای قبولی</th>'.PHP_EOL."\t\t".'<th>تعداد مردود شده</th>'.PHP_EOL."\t\t".'<th>تعداد قبولی</th>'.PHP_EOL."\t\t".'<th>میانگین تعداد تلاش ها برای قبولی</th>'."\t\t".'</tr>';

                $tempText .= '<tr>'.'<td>پایگاه داده مقدماتی</td>'.'<td>آزمون 1</td>'.'<td>18</td>'.'<td>19</td>'.'<td>2</td>'.'<td>16</td>'.'<td>1.18</td>'.'</tr>';

                $tempText .= '<tr>'.'<td>پایگاه داده پیشرفته</td>'.'<td>آزمون اول</td>'.'<td>25</td>'.'<td>21</td>'.'<td>4</td>'.'<td>21</td>'.'<td>1</td>'.'</tr>';
            }
            else {
                $tempText .= '<div id="div_class">'.PHP_EOL.
                    "\t".'<h3 class="main_title">میانگین تعداد تلاش ها برای قبولی در آزمون ها در تمام دوره ها </h3>'.PHP_EOL.
                    "\t".'<table class="data-table">'.PHP_EOL."\t\t".'<tr>'.PHP_EOL.
                    "\t\t".'<th>نام دوره</th>'.PHP_EOL."\t\t".'<th>نام آزمون</th>'.PHP_EOL."\t\t".'<th>تعداد شرکت کنندگان در آزمون</th>'.PHP_EOL."\t\t".'<th>مجموع تلاش ها برای قبولی</th>'.PHP_EOL."\t\t".'<th>تعداد مردود شده</th>'.PHP_EOL."\t\t".'<th>تعداد قبولی</th>'.PHP_EOL."\t\t".'<th>میانگین تعداد تلاش ها برای قبولی</th>'."\t\t".'</tr>';

                $tempText .= '<tr>'.'<td>طراحی الگوریتم</td>'.'<td>آزمون میانترم</td>'.'<td>20</td>'.'<td>18</td>'.'<td>3</td>'.'<td>17</td>'.'<td>1.05</td>'.'</tr>';
                $tempText .= '<tr>'.'<td>مدار منطقی</td>'.'<td>آزمون اول</td>'.'<td>25</td>'.'<td>25</td>'.'<td>0</td>'.'<td>25</td>'.'<td>1</td>'.'</tr>';
                $tempText .= '<tr>'.'<td>پایگاه داده مقدماتی</td>'.'<td>آزمون 1</td>'.'<td>18</td>'.'<td>19</td>'.'<td>2</td>'.'<td>16</td>'.'<td>1.18</td>'.'</tr>';
                $tempText .= '<tr>'.'<td>پایگاه داده پیشرفته</td>'.'<td>آزمون اول</td>'.'<td>25</td>'.'<td>21</td>'.'<td>4</td>'.'<td>21</td>'.'<td>1</td>'.'</tr>';

            }
            $tempText .= "\t".'</table>'.PHP_EOL.'</div>'.'<br>';
        }
        else {
            if ($user === 'user') {
                $tempText .= '<div id="div_class">'.PHP_EOL.
                    "\t".'<h3 class="main_title">میانگین تعداد تلاش ها برای قبولی در آزمون ها در دوره های sample_name</h3>'.PHP_EOL;


                if ($plot === 'bar') {
                    $chart = (new ChartJS_Bar(['آزمون 1 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 2 با 17 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده'], [1, 1.17, 1.05], 'پایگاه داده پیشرفته', 'میانگین تعداد تلاش ها در دوره پایگاه داده پیشرفته'))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Bar(['آزمون اول با 16 نفر قبولی و 20 نفر شرکت کننده', 'آزمون دوم با 25 نفر قبولی و 25 نفر شرکت کننده'], [1.18, 1], 'پایگاه داده مقدماتی', 'میانگین تعداد تلاش ها در دوره پایگاه داده مقدماتی'))->renderChart();
                    $tempText .= $chart;
                }
                else if ($plot === 'pie' || $plot === 'doughnut') {
                    $isDoughnut = $plot === 'doughnut';

                    $chart = (new ChartJS_Pie(['آزمون 1 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 2 با 17 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده'], [1, 1.17, 1.05], 'پایگاه داده پیشرفته', 'میانگین تعداد تلاش ها در دوره پایگاه داده پیشرفته', $isDoughnut))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Pie(['آزمون اول با 16 نفر قبولی و 20 نفر شرکت کننده', 'آزمون دوم با 25 نفر قبولی و 25 نفر شرکت کننده'], [1.18, 1], 'پایگاه داده مقدماتی', 'میانگین تعداد تلاش ها در دوره پایگاه داده مقدماتی', $isDoughnut))->renderChart();
                    $tempText .= $chart;
                }
                else if (strpos($plot, 'line') >= 0) {
                    $isSmooth = $plot === 'line_smooth';

                    $chart = (new ChartJS_Line(['آزمون 1 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 2 با 17 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده'], [1, 1.17, 1.05], 'پایگاه داده پیشرفته', 'میانگین تعداد تلاش ها در دوره پایگاه داده پیشرفته', $isSmooth))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Line(['آزمون اول با 16 نفر قبولی و 20 نفر شرکت کننده', 'آزمون دوم با 25 نفر قبولی و 25 نفر شرکت کننده'], [1.18, 1], 'پایگاه داده مقدماتی', 'میانگین تعداد تلاش ها در دوره پایگاه داده مقدماتی', $isSmooth))->renderChart();
                    $tempText .= $chart;
                }
                $tempText .= '<h3 style="font-weight: normal">میانگین تعداد تلاش ها برای دوره طراحی الگوریتم وجود ندارد.</h3><br>';
            }
            else {
                $tempText .= '<div id="div_class">'.PHP_EOL.
                    "\t".'<h3 class="main_title">میانگین تعداد تلاش ها برای قبولی در تمام دوره ها </h3>'.PHP_EOL;

                if ($plot === 'bar') {
                    $chart = (new ChartJS_Bar(['آزمون 1 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 2 با 17 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده'], [1, 1.17, 1.05], 'پایگاه داده پیشرفته', 'میانگین تعداد تلاش ها در دوره پایگاه داده پیشرفته'))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Bar(['آزمون 1 با 18 نفر قبولی و 25 نفر شرکت کننده', 'آزمون 2 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده', 'آزمون 4 با 22 نفر قبولی و 22 نفر شرکت کننده'], [1.2, 1, 1.25, 1.09], 'مدار منطقی', 'میانگین تعداد تلاش ها در دوره مدار منطقی'))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Bar(['آزمون اول با 16 نفر قبولی و 20 نفر شرکت کننده', 'آزمون دوم با 25 نفر قبولی و 25 نفر شرکت کننده'], [1.18, 1], 'پایگاه داده مقدماتی', 'میانگین تعداد تلاش ها در دوره پایگاه داده مقدماتی'))->renderChart();
                    $tempText .= $chart;
                }
                else if ($plot === 'pie' || $plot === 'doughnut') {
                    $isDoughnut = $plot === 'doughnut';

                    $chart = (new ChartJS_Pie(['آزمون 1 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 2 با 17 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده'], [1, 1.17, 1.05], 'پایگاه داده پیشرفته', 'میانگین تعداد تلاش ها در دوره پایگاه داده پیشرفته', $isDoughnut))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Pie(['آزمون 1 با 18 نفر قبولی و 25 نفر شرکت کننده', 'آزمون 2 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده', 'آزمون 4 با 22 نفر قبولی و 22 نفر شرکت کننده'], [1.2, 1, 1.25, 1.09], 'مدار منطقی', 'میانگین تعداد تلاش ها در دوره مدار منطقی', $isDoughnut))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Pie(['آزمون اول با 16 نفر قبولی و 20 نفر شرکت کننده', 'آزمون دوم با 25 نفر قبولی و 25 نفر شرکت کننده'], [1.18, 1], 'پایگاه داده مقدماتی', 'میانگین تعداد تلاش ها در دوره پایگاه داده مقدماتی', $isDoughnut))->renderChart();
                    $tempText .= $chart;
                }
                else if (strpos($plot, 'line') >= 0) {
                    $isSmooth = $plot === 'line_smooth';

                    $chart = (new ChartJS_Line(['آزمون 1 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 2 با 17 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده'], [1, 1.17, 1.05], 'پایگاه داده پیشرفته', 'میانگین تعداد تلاش ها در دوره پایگاه داده پیشرفته', $isSmooth))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Line(['آزمون 1 با 18 نفر قبولی و 25 نفر شرکت کننده', 'آزمون 2 با 20 نفر قبولی و 20 نفر شرکت کننده', 'آزمون 3 با 20 نفر قبولی و 25 نفر شرکت کننده', 'آزمون 4 با 22 نفر قبولی و 22 نفر شرکت کننده'], [1.2, 1, 1.25, 1.09], 'مدار منطقی', 'میانگین تعداد تلاش ها در دوره مدار منطقی', $isSmooth))->renderChart();
                    $tempText .= $chart;

                    $chart = (new ChartJS_Line(['آزمون اول با 16 نفر قبولی و 20 نفر شرکت کننده', 'آزمون دوم با 25 نفر قبولی و 25 نفر شرکت کننده'], [1.18, 1], 'پایگاه داده مقدماتی', 'میانگین تعداد تلاش ها در دوره پایگاه داده مقدماتی', $isSmooth))->renderChart();
                    $tempText .= $chart;
                }
                $tempText .= '<h3 style="font-weight: normal">میانگین تعداد تلاش ها برای دوره طراحی الگوریتم وجود ندارد.</h3><br>';
            }
            $tempText .= "\t".PHP_EOL.'</div>'.'<br>';
        }
        return $tempText;

	}

}

?>