<?php

require_once '../../../models/ChartJS_Bar.php';
require_once '../../../models/ChartJS_Pie.php';
require_once '../../../models/ChartJS_Line.php';
use Models\ChartJS_Bar;
use Models\ChartJS_Pie;
use Models\ChartJS_Line;

class TeacherPreview {

    public function teacher_average_times_pent ($user, $plot, $timeGrouping): string
    {
        $tempText = '';

        if ($plot === 'total') {
            $tempText .= '<div id="div_class">'.PHP_EOL."\t";
            if ($user === 'user') {
                $tempText .= '<h3 class="main_title">میانگین مدت زمان سپری شده در سامانه برای sample_teacher_username</h3>';

                $tempText .= '<h3 style="font-weight: normal">2.23 (ساعت)</h3>';

            }
            else {
                $tempText .= '<h3 class="main_title">میانگین مدت زمان سپری شده در سامانه برای تمام مدرسان</h3>';

                $tempText .= '<table class="data-table">'.PHP_EOL."\t\t".'<tr>'.PHP_EOL."\t\t".'<th>نام کاربری</th>'.PHP_EOL."\t\t".'<th>میانگین مدت زمان ها (ساعت)</th>'.PHP_EOL."\t\t".'</tr>';


                $tempText .= '<tr>'.'<td>sample_teacher_username</td>'.'<td>2.24</td>'.'</tr>';
                $tempText .= '<tr>'.'<td>new_teacher1</td>'.'<td>0.83</td>'.'</tr>';
                $tempText .= '<tr>'.'<td>teacher2</td>'.'<td>3.12</td>'.'</tr>';
                $tempText .= '<tr>'.'<td>new_teacher3</td>'.'<td>0.59</td>'.'</tr>';
                $tempText .= '<tr>'.'<td>teacher4</td>'.'<td>1.03</td>'.'</tr>';

                $tempText .= '</table>'.PHP_EOL;
            }
            $tempText .= PHP_EOL.'</div>'."<br>";
        }
        else {
            $timeText = 'روزانه';
            if ($timeGrouping === 'weekly') $timeText = 'هفتگی';

            if ($user === 'user') {
                $tempText .= '<div id="div_class">'.PHP_EOL."\t";
                $tempText .= '<h3 class="main_title">میانگین مدت زمان سپری شده در سامانه برای sample_teacher2 به صورت '.$timeText.'</h3>';

                if ($plot === 'bar') {
                    if ($timeGrouping === 'daily') {
                        $chart1 = (new ChartJS_Bar(['89', '94', '97', /*1*/ '99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [0.09, 0.03, 0.25, /*1*/ 0.1, 0.02, 0.12, 0.2, /*2*/ 0.14, 0.15, 0.014, 0.011, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.4, 0.181, 1.01, 0.014, /*5*/ 0.03, 0.018, 0.18, 0.1, /*6*/ 0.01, 0.03, 0.02, 0.14], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه'))->renderChart();
                        $tempText .= $chart1;
                    }
                    else {
                        $chart1 = (new ChartJS_Bar(['13', '14', '15', '16', /*1*/ '18', '20', '21', '22', /*2*/ '23', '24', '26', '27', /*3*/ '28', '30', '31', '32'], [0.4, 0.41, 0.3, 0.25, /*1*/ 0.4, 0.52, 1.01, 0.66, /*2*/ 0.45, 0.53, 0.62, 1.86, /*3*/ 0.44, 0.49, 0.32, 0.62], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه'))->renderChart();
                        $tempText .= $chart1;
                    }
                }
                else if ($plot === 'pie' || $plot === 'doughnut') {
                    $isDoughnut = $plot === 'doughnut';

                    if ($timeGrouping === 'daily') {
                        $chart1 = (new ChartJS_Pie(['89', '94', '97', /*1*/ '99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [0.09, 0.03, 0.25, /*1*/ 0.1, 0.02, 0.12, 0.2, /*2*/ 0.14, 0.15, 0.014, 0.011, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.4, 0.181, 1.01, 0.014, /*5*/ 0.03, 0.018, 0.18, 0.1, /*6*/ 0.01, 0.03, 0.02, 0.14], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه', $isDoughnut))->renderChart();
                        $tempText .= $chart1;
                    }
                    else {
                        $chart1 = (new ChartJS_Pie(['14', '15', '16', /*1*/ '18', '20', '21', '22', /*2*/ '23', '24', '26', '27', /*3*/ '28', '30', '31', '32'], [0.41, 0.3, 0.25, /*1*/ 0.4, 0.52, 1.01, 0.66, /*2*/ 0.45, 0.53, 0.62, 1.86, /*3*/ 0.44, 0.49, 0.32, 0.62], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه', $isDoughnut))->renderChart();
                        $tempText .= $chart1;
                    }
                }
                else if (strpos($plot, 'line') >= 0) {
                    $isSmooth = $plot === 'line_smooth';

                    if ($timeGrouping === 'daily') {
                        $chart1 = (new ChartJS_Line(['89', '94', '97', /*1*/ '99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [0.09, 0.03, 0.25, /*1*/ 0.1, 0.03, 0.12, 0.2, /*2*/ 0.14, 0.15, 0.014, 0.011, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.4, 0.181, 1.01, 0.014, /*5*/ 0.03, 0.018, 0.18, 0.1, /*6*/ 0.01, 0.03, 0.02, 0.14], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه', $isSmooth))->renderChart();
                        $tempText .= $chart1;
                    }
                    else {
                        $chart1 = (new ChartJS_Line(['14', '15', '16', /*1*/ '18', '20', '21', '22', /*2*/ '23', '24', '26', '27', /*3*/ '28', '30', '31', '32'], [0.41, 0.3, 0.25, /*1*/ 0.4, 0.52, 1.01, 0.66, /*2*/ 0.45, 0.53, 0.63, 1.86, /*3*/ 0.44, 0.49, 0.32, 0.62], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه', $isSmooth))->renderChart();
                        $tempText .= $chart1;
                    }
                }
            }
            else {
                $tempText .= '<div id="div_class">'.PHP_EOL."\t";
                $tempText .= '<h3 class="main_title">میانگین مدت زمان سپری شده در سامانه برای تمام مدرسان به صورت '.$timeText.'</h3>';

                if ($plot === 'bar') {
                    if ($timeGrouping === 'daily') {
                        $chart1 = (new ChartJS_Bar(['89', '94', '97', /*1*/ '99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [0.09, 0.03, 0.25, /*1*/ 0.1, 0.02, 0.12, 0.2, /*2*/ 0.14, 0.15, 0.014, 0.011, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.4, 0.181, 1.01, 0.014, /*5*/ 0.03, 0.018, 0.18, 0.1, /*6*/ 0.01, 0.03, 0.02, 0.14], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه'))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Bar(['99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [ 0.03, 0.02, 0.12, 0.4, /*2*/ 0.14, 0.52, 0.014, 0.015, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.35, 0.181, 0.71, 0.014, /*5*/ 0.04, 0.018, 0.14, 0.3, /*6*/ 0.02, 0.11, 0.09, 0.24], 'teacher4', 'میانگین مدت زمان سپری شده برای teacher4 در سامانه'))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Bar(['95', '101', '102', '110', /*2*/ '115', '117', '119', '121', /*3*/ '122', '123', '125', '127', /*4*/ '135', '137', '138', '139'], [ 0.03, 0.04, 0.09, 0.25, /*2*/ 0.19, 0.04, 0.024, 0.031, /*3*/ 0.11, 0.102, 0.05, 0.023, /*4*/ 0.251, 0.081, 0.31, 0.014], 'teacher5', 'میانگین مدت زمان سپری شده برای teacher5 در سامانه'))->renderChart();
                        $tempText .= $chart1;

                        $tempText .= '<h3 style="font-weight: normal">sample_teacher3 هیچ زمانی را در سامانه سپری نکرده است.</h3>';
                    }
                    else {
                        $chart1 = (new ChartJS_Bar(['13', '14', '15', '16', /*1*/ '18', '20', '21', '22', /*2*/ '23', '24', '26', '27', /*3*/ '28', '30', '31', '32'], [0.4, 0.41, 0.3, 0.25, /*1*/ 0.4, 0.52, 1.01, 0.66, /*2*/ 0.45, 0.53, 0.62, 1.86, /*3*/ 0.44, 0.49, 0.32, 0.62], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه'))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Bar(['11', '12', '14', '15', /*2*/ '16', '17', '19', '21', /*3*/ '22', '23', '24', '26'], [ 0.43, 0.22, 0.72, 1.04, /*2*/ 0.14, 0.42, 0.014, 0.15, /*3*/ 0.151, 0.19, 0.89, 0.52], 'teacher4', 'میانگین مدت زمان سپری شده برای teacher4 در سامانه'))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Bar(['10', '11', '12', '13', /*2*/ '14', '15', '16', '18', /*3*/ '19', '21', '23', '25', /*4*/ '26', '27', '28', '29', /*5*/ '31'], [ 0.19, 0.74, 0.6, 0.25, /*2*/ 0.19, 0.04, 0.024, 0.031, /*3*/ 0.11, 0.102, 0.05, 0.23, /*4*/ 0.351, 0.81, 0.31, 0.014, /*5*/ 0.9], 'teacher5', 'میانگین مدت زمان سپری شده برای teacher5 در سامانه'))->renderChart();
                        $tempText .= $chart1;

                        $tempText .= '<h3 style="font-weight: normal">sample_teacher3 هیچ زمانی را در سامانه سپری نکرده است.</h3>';
                    }
                }
                else if ($plot === 'pie' || $plot === 'doughnut') {
                    $isDoughnut = $plot === 'doughnut';

                    if ($timeGrouping === 'daily') {
                        $chart1 = (new ChartJS_Pie(['89', '94', '97', /*1*/ '99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [0.09, 0.03, 0.25, /*1*/ 0.1, 0.02, 0.12, 0.2, /*2*/ 0.14, 0.15, 0.014, 0.011, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.4, 0.181, 1.01, 0.014, /*5*/ 0.03, 0.018, 0.18, 0.1, /*6*/ 0.01, 0.03, 0.02, 0.14], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه', $isDoughnut))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Pie(['99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [ 0.03, 0.02, 0.12, 0.4, /*2*/ 0.14, 0.52, 0.014, 0.015, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.35, 0.181, 0.71, 0.014, /*5*/ 0.04, 0.018, 0.14, 0.3, /*6*/ 0.02, 0.11, 0.09, 0.24], 'teacher4', 'میانگین مدت زمان سپری شده برای teacher4 در سامانه', $isDoughnut))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Pie(['95', '101', '102', '110', /*2*/ '115', '117', '119', '121', /*3*/ '122', '123', '125', '127', /*4*/ '135', '137', '138', '139'], [ 0.03, 0.04, 0.09, 0.25, /*2*/ 0.19, 0.04, 0.024, 0.031, /*3*/ 0.11, 0.102, 0.05, 0.023, /*4*/ 0.251, 0.081, 0.31, 0.014], 'teacher5', 'میانگین مدت زمان سپری شده برای teacher5 در سامانه', $isDoughnut))->renderChart();
                        $tempText .= $chart1;

                        $tempText .= '<h3 style="font-weight: normal">sample_teacher3 هیچ زمانی را در سامانه سپری نکرده است.</h3>';
                    }
                    else {
                        $chart1 = (new ChartJS_Pie(['13', '14', '15', '16', /*1*/ '18', '20', '21', '22', /*2*/ '23', '24', '26', '27', /*3*/ '28', '30', '31', '32'], [0.4, 0.41, 0.3, 0.25, /*1*/ 0.4, 0.52, 1.01, 0.66, /*2*/ 0.45, 0.53, 0.62, 1.86, /*3*/ 0.44, 0.49, 0.32, 0.62], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه', $isDoughnut))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Pie(['11', '12', '14', '15', /*2*/ '16', '17', '19', '21', /*3*/ '22', '23', '24', '26'], [ 0.43, 0.22, 0.72, 1.04, /*2*/ 0.14, 0.42, 0.014, 0.15, /*3*/ 0.151, 0.19, 0.89, 0.52], 'teacher4', 'میانگین مدت زمان سپری شده برای teacher4 در سامانه', $isDoughnut))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Pie(['10', '11', '12', '13', /*2*/ '14', '15', '16', '18', /*3*/ '19', '21', '23', '25', /*4*/ '26', '27', '28', '29', /*5*/ '31'], [ 0.19, 0.74, 0.6, 0.25, /*2*/ 0.19, 0.04, 0.024, 0.031, /*3*/ 0.11, 0.102, 0.05, 0.23, /*4*/ 0.351, 0.81, 0.31, 0.014, /*5*/ 0.9], 'teacher5', 'میانگین مدت زمان سپری شده برای teacher5 در سامانه', $isDoughnut))->renderChart();
                        $tempText .= $chart1;

                        $tempText .= '<h3 style="font-weight: normal">sample_teacher3 هیچ زمانی را در سامانه سپری نکرده است.</h3>';
                    }
                }
                else if (strpos($plot, 'line') >= 0) {
                    $isSmooth = $plot === 'line_smooth';

                    if ($timeGrouping === 'daily') {
                        $chart1 = (new ChartJS_Line(['89', '94', '97', /*1*/ '99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [0.09, 0.03, 0.25, /*1*/ 0.1, 0.02, 0.12, 0.2, /*2*/ 0.14, 0.15, 0.014, 0.011, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.4, 0.181, 1.01, 0.014, /*5*/ 0.03, 0.018, 0.18, 0.1, /*6*/ 0.01, 0.03, 0.02, 0.14], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه', $isSmooth))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Line(['99', '100', '102', '117', /*2*/ '118', '119', '120', '121', /*3*/ '122', '123', '124', '126', /*4*/ '131', '137', '138', '139', /*5*/ '140', '141', '142', '143', /*6*/ '144', '145', '146', '148'], [ 0.03, 0.02, 0.12, 0.4, /*2*/ 0.14, 0.52, 0.014, 0.015, /*3*/ 0.101, 0.109, 0.1, 0.02, /*4*/ 0.35, 0.181, 0.71, 0.014, /*5*/ 0.04, 0.018, 0.14, 0.3, /*6*/ 0.02, 0.11, 0.09, 0.24], 'teacher4', 'میانگین مدت زمان سپری شده برای teacher4 در سامانه', $isSmooth))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Line(['95', '101', '102', '110', /*2*/ '115', '117', '119', '121', /*3*/ '122', '123', '125', '127', /*4*/ '135', '137', '138', '139'], [ 0.03, 0.04, 0.09, 0.25, /*2*/ 0.19, 0.04, 0.024, 0.031, /*3*/ 0.11, 0.102, 0.05, 0.023, /*4*/ 0.251, 0.081, 0.31, 0.014], 'teacher5', 'میانگین مدت زمان سپری شده برای teacher5 در سامانه', $isSmooth))->renderChart();
                        $tempText .= $chart1;

                        $tempText .= '<h3 style="font-weight: normal">sample_teacher3 هیچ زمانی را در سامانه سپری نکرده است.</h3>';
                    }
                    else {
                        $chart1 = (new ChartJS_Line(['13', '14', '15', '16', /*1*/ '18', '20', '21', '22', /*2*/ '23', '24', '26', '27', /*3*/ '28', '30', '31', '32'], [0.4, 0.41, 0.3, 0.25, /*1*/ 0.4, 0.52, 1.01, 0.66, /*2*/ 0.45, 0.53, 0.62, 1.86, /*3*/ 0.44, 0.49, 0.32, 0.62], 'sample_teacher2', 'میانگین مدت زمان سپری شده برای sample_teacher2 در سامانه', $isSmooth))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Line(['11', '12', '14', '15', /*2*/ '16', '17', '19', '21', /*3*/ '22', '23', '24', '26'], [ 0.43, 0.22, 0.72, 1.04, /*2*/ 0.14, 0.42, 0.014, 0.15, /*3*/ 0.151, 0.19, 0.89, 0.52], 'teacher4', 'میانگین مدت زمان سپری شده برای teacher4 در سامانه', $isSmooth))->renderChart();
                        $tempText .= $chart1;

                        $chart1 = (new ChartJS_Line(['10', '11', '12', '13', /*2*/ '14', '15', '16', '18', /*3*/ '19', '21', '23', '25', /*4*/ '26', '27', '28', '29', /*5*/ '31'], [ 0.19, 0.74, 0.6, 0.25, /*2*/ 0.19, 0.04, 0.024, 0.031, /*3*/ 0.11, 0.102, 0.05, 0.23, /*4*/ 0.351, 0.81, 0.31, 0.014, /*5*/ 0.9], 'teacher5', 'میانگین مدت زمان سپری شده برای teacher5 در سامانه', $isSmooth))->renderChart();
                        $tempText .= $chart1;

                        $tempText .= '<h3 style="font-weight: normal">sample_teacher3 هیچ زمانی را در سامانه سپری نکرده است.</h3>';
                    }
                }
            }
            $tempText .= "\t\t".'</div>'."<br>";
        }
        return $tempText;

	}

}

?>